const data = {
    puzzle_id: -1,
    fen: "8/8/8/4B3/8/8/8/8 w - - 0 1",
    topic: "Слон",
    subtopic: "",
    title: "Слон – младший брат ферзя. Как и ферзь, слон передвигается на любое количество полей, но только по диагоналям. Все шахматные фигуры могут перемещаться по полям разных цветов, но это не относится к слону. Слон до конца партии будет ходить по полям одного цвета. Поэтому слоны называются белопольными и чернопольными.",
    weight: null,
    mode: 'basic',
    difficulty: null,
    variants: null,
    closed: true,
};

export default data;
