const data = {
    puzzle_id: -1,
    fen: "8/8/8/8/3P4/8/P7/8 w - - 0 1",
    topic: "Король",
    subtopic: "",
    title: "Пешка – единственная фигура, которой не разрешается делать ходы назад. Пешки передвигаются по вертикалям, только вперед и только на одно поле. Исключение – если пешка стоит на начальной позиции, то она может, по выбору шахматиста, двинуться на одно или на два поля.",
    weight: null,
    mode: 'basic',
    difficulty: null,
    variants: null,
    closed: true,
};

export default data;
